TexasInstruments/c2000ware-core-sdk/device_support/f2805x/common/source/F2805x_DefaultIsr.c
__interrupt void USER10_ISR(void)    // User Defined trap 10
{
  // Insert ISR Code here

  // Next two lines for debug only to halt the processor here
  // Remove after inserting ISR Code
 asm ("      ESTOP0");
  for(;;);
}

__interrupt void USER11_ISR(void)    // User Defined trap 11
{
  // Insert ISR Code here

  // Next two lines for debug only to halt the processor here
  // Remove after inserting ISR Code
 asm ("      ESTOP0");
  for(;;);
}

__interrupt void USER12_ISR(void)     // User Defined trap 12
{
 // Insert ISR Code here

  // Next two lines for debug only to halt the processor here
  // Remove after inserting ISR Code
 asm ("      ESTOP0");
  for(;;);

}

// -----------------------------------------------------------
// PIE Group 1 - MUXed into CPU INT1
// -----------------------------------------------------------
// INT1.1
// ADC  (Can also be ISR for INT10.1 when enabled)
__interrupt void ADCINT1_ISR(void)
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code

    asm ("      ESTOP0");
    for(;;);

}

// INT1.2
// ADC (Can also be ISR for INT10.2 when enabled)
__interrupt void ADCINT2_ISR(void)
{

    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code

    asm("    ESTOP0");
    for(;;);

}

// INT1.3 - Reserved

// INT1.4
__interrupt void  XINT1_ISR(void)
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);

}

// INT1.5
__interrupt void  XINT2_ISR(void)
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);

}

// INT1.6
__interrupt void  ADCINT9_ISR(void)     // ADC
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT1.7
__interrupt void  TINT0_ISR(void)      // CPU-Timer 0
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT1.8
__interrupt void  WAKEINT_ISR(void)    // WD, LOW Power
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// -----------------------------------------------------------
// PIE Group 2 - MUXed into CPU INT2
// -----------------------------------------------------------

// INT2.1
__interrupt void EPWM1_TZINT_ISR(void)    // EPWM-1
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT2.2
__interrupt void EPWM2_TZINT_ISR(void)    // EPWM-2
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT2.3
__interrupt void EPWM3_TZINT_ISR(void)    // EPWM-3
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT2.4
__interrupt void EPWM4_TZINT_ISR(void)    // EPWM-4
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT2.5
__interrupt void EPWM5_TZINT_ISR(void)    // EPWM-5
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT2.6
__interrupt void EPWM6_TZINT_ISR(void)    // EPWM-6
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT2.7
__interrupt void EPWM7_TZINT_ISR(void)    // EPWM-7
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT2.8 - Reserved

// -----------------------------------------------------------
// PIE Group 3 - MUXed into CPU INT3
// -----------------------------------------------------------

// INT 3.1
__interrupt void EPWM1_INT_ISR(void)     // EPWM-1
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT3.2
__interrupt void EPWM2_INT_ISR(void)     // EPWM-2
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

