TexasInstruments/c2000ware-core-sdk/device_support/f2805x/common/source/F2805x_DefaultIsr.c
// INT9.2
__interrupt void SCITXINTA_ISR(void)     // SCI-A
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT9.3
__interrupt void SCIRXINTB_ISR(void)     // SCI-B
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT9.4
__interrupt void SCITXINTB_ISR(void)     // SCI-B
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT9.5
__interrupt void ECAN0INTA_ISR(void)  // eCAN-A
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT9.6
__interrupt void ECAN1INTA_ISR(void)  // eCAN-A
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT9.7 - Reserved
// INT9.8 - Reserved

// -----------------------------------------------------------
// PIE Group 10 - MUXed into CPU INT10
// -----------------------------------------------------------

// INT10.1 - Reserved or ADCINT1_ISR
// INT10.2 - Reserved or ADCINT2_ISR

// INT10.3
__interrupt void ADCINT3_ISR(void)    // ADC
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT10.4
__interrupt void ADCINT4_ISR(void)    // ADC
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT10.5
__interrupt void ADCINT5_ISR(void)    // ADC
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT10.6
__interrupt void ADCINT6_ISR(void)    // ADC
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT10.7
__interrupt void ADCINT7_ISR(void)    // ADC
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT10.8
__interrupt void ADCINT8_ISR(void)    // ADC
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}


// -----------------------------------------------------------
// PIE Group 11 - MUXed into CPU INT11
// -----------------------------------------------------------

// INT11.1
__interrupt void CLA1_INT1_ISR(void)   // MCLA
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code

    asm ("      ESTOP0");
    for(;;);
}

// INT11.2
__interrupt void CLA1_INT2_ISR(void)  // MCLA
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code

    asm("    ESTOP0");
    for(;;);
}

// INT11.3
__interrupt void CLA1_INT3_ISR(void)    // MCLA
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT11.4
__interrupt void CLA1_INT4_ISR(void)    // MCLA
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT11.5
__interrupt void CLA1_INT5_ISR(void)    // MCLA
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

