TexasInstruments/c2000ware-core-sdk/device_support/f2805x/common/source/F2805x_DefaultIsr.c
// INT11.6
__interrupt void CLA1_INT6_ISR(void)    // MCLA
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT11.7
__interrupt void CLA1_INT7_ISR(void)    // MCLA
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT11.8
__interrupt void CLA1_INT8_ISR(void)    // MCLA
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// -----------------------------------------------------------
// PIE Group 12 - MUXed into CPU INT12
// -----------------------------------------------------------

// INT12.1
__interrupt void XINT3_ISR(void)  // External __interrupt 3
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}
// INT12.2 - Reserved
// INT12.3 - Reserved
// INT12.4 - Reserved
// INT12.5 - Reserved
// INT12.6 - Reserved

// INT12.7
__interrupt void LVF_ISR(void)  // CLA1 - overflow
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// INT12.8
__interrupt void LUF_ISR(void)  // CLA1 - underflow
{
    // Insert ISR Code here

    // To receive more __interrupts from this PIE group, acknowledge this
    // __interrupt PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

//---------------------------------------------------------------------------
// Catch All Default ISRs:
//

__interrupt void EMPTY_ISR(void)  // Empty ISR - only does a return.
{

}

__interrupt void PIE_RESERVED(void)  // Reserved space.  For test.
{
 asm ("      ESTOP0");
  for(;;);
}

__interrupt void rsvd_ISR(void)      // For test
{
 asm ("      ESTOP0");
  for(;;);
}

//
// End of file.
//

